Before you turn this problem in, make sure everything runs as expected. First, **restart the kernel** (in the menu bar, select Kernel$\rightarrow$Restart) and then **run all cells** (in the menu bar, select Cell$\rightarrow$Run All).

Make sure that in addition to the code, you provide written answers for all questions of the assignment.

## Assignment 2 - Data Analysis using Pandas
**(15 points total)**

For this assignment, we will analyze the open dataset with data on the passengers aboard the Titanic.

The data file for this assignment can be downloaded from Kaggle website: https://www.kaggle.com/c/titanic/data, file `train.csv`. It is also attached to the assignment page. The definition of all variables can be found on the same Kaggle page, in the Data Dictionary section.

Read the data from the file into pandas DataFrame. Analyze, clean and transform the data to answer the following question: 

**What categories of passengers were most likely to survive the Titanic disaster?**

**Question 1.**  _(4 points)_
* The answer to the main question - What categories of passengers were most likely to survive the Titanic disaster? _(2 points)_
* The detailed explanation of the logic of the analysis _(2 points)_

**Question 2.**  _(3 points)_
* What other attributes did you use for the analysis? Explain how you used them and why you decided to use them. 
* Provide a complete list of all attributes used.

**Question 3.**  _(3 points)_
* Did you engineer any attributes (created new attributes)? If yes, explain the rationale and how the new attributes were used in the analysis?
* If you have excluded any attributes from the analysis, provide an explanation why you believe they can be excluded.

**Question 4.**  _(5 points)_
* How did you treat missing values for those attributes that you included in the analysis (for example, `age` attribute)? Provide a detailed explanation in the comments.

# Note:

In this work, I have described the steps I took as I analyzed the dataset. I have answered the questions mentioned above in a different order it was asked and all the detailed explanations are in the body of the notebook.

In [1]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

titanic_train = pd.read_csv('train.csv')
df = pd.DataFrame(titanic_train)


df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Quick investigation of data

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

Check for missing data. Only 3 attributes with missing data: Age, Cabin and Embarked.

In [3]:
# Check for the total number of missing data in the titanic dataframe
df.isnull().sum().sum()

866

In [4]:
# Number of missing entries in columns with missing data
null_columns = df.columns[df.isnull().any()]
df[null_columns].isnull().sum().to_frame(name = 'Number of missing entries')

          Number of missing entries
Age                             177
Cabin                           687
Embarked                          2

As can be seen, the dataset consists  of 891 rows/entries and 12 columns/attributes. Seven columns contain numeric data and five are of the dtype object. There are a total of 866 individual entries missing. Only the columns Age, Cabin and Embarked have missing values.

In [5]:
# Total count of passengers that survived(1) and died(0)
df.groupby('Survived').size().to_frame(name = 'Counts')

          Counts
Survived
0            549
1            342

In [6]:
# % of people that survived
survived_percent = df['Survived'].mean()*100
print(round(survived_percent, 2), '% survived' )

38.38 % survived

Our target attribute or dependent variable for this problem is 'Survived'. Out of the 891 passengers in the dataset, 38.38% survived. To determine which categories of passengers were most likely to make it, let's take a look at these attributes in the context of survival.

## Sex

In [7]:
# Total count of male and female in the dataset
df.groupby('Sex').size().to_frame(name = 'Counts')

        Counts
Sex
female     314
male       577

In [8]:
# Total count of male and female that survived and died
df.groupby(['Sex', 'Survived']).size().to_frame(name = 'Counts')

                 Counts
Sex    Survived
female 0             81
       1            233
male   0            468
       1            109

In [9]:
by_sex = df.groupby('Sex')['Survived'].mean()
by_sex = by_sex.apply(lambda x: x *100).to_frame(name = '% Survived')
by_sex

        % Survived
Sex
female   74.203822
male     18.890815

Evidently, women are most likely to survive the disaster. From the data, 74.2% of the 341 women survived compared to only 18.9% of the 577 total number of men in this set.

## Pclass

In [10]:
# Total number of passengers in Pclass 1, 2, 3 that survived and died
df.groupby(['Pclass','Survived']).size().to_frame(name = 'Counts')

                 Counts
Pclass Survived
1      0             80
       1            136
2      0             97
       1             87
3      0            372
       1            119

In [11]:
by_Pclass =df.groupby('Pclass')['Survived'].mean()
by_Pclass = by_Pclass.apply(lambda x: x*100).to_frame(name = '% Survived')
by_Pclass

        % Survived
Pclass
1        62.962963
2        47.282609
3        24.236253

Passengers in first class (Pclass 1) also fared better. They have the highest rate of survival relative to those belonging in lower socio-economic brackets (Pclass 2 and 3). Passengers in second class has a survival rate of 47.3 %, while only 24.2 % of third class passengers made it.

## Fare

In [12]:
# Total count of fare price in relation to whether they survived or died
df.groupby(['Fare', 'Survived']).size().head()

Fare    Survived
0.0000  0           14
        1            1
4.0125  0            1
5.0000  0            1
6.2375  0            1
dtype: int64

In [13]:
df.groupby('Fare')[ 'Survived'].mean().head()

Fare
0.0000    0.066667
4.0125    0.000000
5.0000    0.000000
6.2375    0.000000
6.4375    0.000000
Name: Survived, dtype: float64

Manipulating data in the same fashion for the attribute 'Fare' didn't seem to provide a meaningful insight. Although, we can assume that passengers belonging to higher classes can afford and will spend more on their fare to ensure a more pleasurable and comfortable journey. If we assume that these two attributes are strongly correlated, then we can drop one, in this case Fare, to make our analysis simpler. (Note: I am probably oversimplifying this comparison so please let me know if treating the data this way makes sense.)


## Correlation between Fare and Pclass

In [14]:
# Calculates the pearson correlation coefficient between attributes 'Pclass' and 'Fare'
df['Pclass'].corr(df['Fare'])

-0.5494996199439078

A positive or negative correlation coeefficient of 0.5 to 1.0 suggests a very strong correlation between two variables. Pclass and Fare have a high calculated correlation coefficient of -0.55. This means that there is a strong linear relationship between these two, such that as  Pclass decreases (higher status), the fare paid increases. Thus, we can drop the attribute Fare.

## Ticket

In [15]:
# Inspection of the 'Ticket' attribute of the first few entries 
df['Ticket'].head()

0           A/5 21171
1            PC 17599
2    STON/O2. 3101282
3              113803
4              373450
Name: Ticket, dtype: object

Following the same line of reasoning, the fare price will correspond to what ticket was purchased so dropping this column also makes sense. Additionally, inspecting the data on ticket shows a collection of string characters that will most likely only provide meaningful information upon analysis against the ship's records (eg ticketing conventions at that time, etc.). It can give an insight on the cabin assigned which can potentially aid in analyzing how accessible the deck is for said passenger. In any case, my assumption in this assignment is that it will still correlate with the fare paid, and ultimately, the socio-economic strata.

## SibSp

In [16]:
# Total number of passengers that survived/died in relation to their 'SibSp' data (Sibling/Spouse)
df.groupby(['SibSp', 'Survived']).size().to_frame(name = 'Counts')

                Counts
SibSp Survived
0     0            398
      1            210
1     0             97
      1            112
2     0             15
      1             13
3     0             12
      1              4
4     0             15
      1              3
5     0              5
8     0              7

In [17]:
by_SibSp = df.groupby('SibSp')['Survived'].mean()
by_SibSp = by_SibSp.apply(lambda x: x*100).to_frame(name = '% Survived')
by_SibSp

       % Survived
SibSp
0       34.539474
1       53.588517
2       46.428571
3       25.000000
4       16.666667
5        0.000000
8        0.000000

Those that have at least a sibling or a spouse with them also have a higher chance surviving the tragedy.

## Parch

In [18]:
#Total number of passengers that survived/died based on their 'Parch' data (Parent(s)/Childern)
df.groupby(['Parch', 'Survived']).size().to_frame(name = 'Counts')

                Counts
Parch Survived
0     0            445
      1            233
1     0             53
      1             65
2     0             40
      1             40
3     0              2
      1              3
4     0              4
5     0              4
      1              1
6     0              1

In [19]:
by_Parch = df.groupby('Parch')['Survived'].mean()
by_Parch = by_Parch.apply(lambda x: x*100).to_frame(name = '% Survived')
by_Parch

       % Survived
Parch
0       34.365782
1       55.084746
2       50.000000
3       60.000000
4        0.000000
5       20.000000
6        0.000000

Being accompanied with a parent or a child also seems to increase the passenger's chances.

Based on the impact of SibSp and Parch on our target attribute, we can create a new feature *'Alone'* which describes if a passenger is with a family member.  For this attribute, a value of 1 means the passenger is alone, and 0 if with a member of the family.

In [20]:
# Engineered attribute that evaluates if a passenger is alone or not given the data on 'SibSp' and 'Parch'

def is_Alone(attributes):
    SibSp,Parch = attributes
    
    if SibSp == 0 and Parch == 0:
        x = 1 # Alone
    else:
        x = 0 # with family
    
    return x

In [21]:
df['Alone'] = df[['SibSp', 'Parch']].apply(is_Alone, axis =1)

In [22]:
df.groupby(['Alone','Survived']).size().to_frame(name = 'Counts')

                Counts
Alone Survived
0     0            175
      1            179
1     0            374
      1            163

In [23]:
by_Alone = df.groupby('Alone')['Survived'].mean()
by_Alone = by_Alone.apply(lambda x: x*100).to_frame(name = '% Survived')
by_Alone

       % Survived
Alone
0       50.564972
1       30.353818

After initial exploration of the dataset, travelling with family seems to increase the rate of survival as 50.6% of those who travelled with family survived compared to 30.4% for those who travelled by themselves.

## Name

In [24]:
# Initial inspection of the first few entries in the dataset
df['Name'].head(10)

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
5                                     Moran, Mr. James
6                              McCarthy, Mr. Timothy J
7                       Palsson, Master. Gosta Leonard
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                  Nasser, Mrs. Nicholas (Adele Achem)
Name: Name, dtype: object

Name, like ticket, contains a collection of string characters. Some names contain titles like Dr., Master, Mr. and Mrs. I originally thought that this would correlate with 'Pclass' meaning those in first class will have distingishing titles in their names. However, upon inspection of the grouped data (names, P1, P2, P3 grouping below), there isn't a lot of entries meeting this criteria. As expected there are a few with 'Drs.' in first and second classes, and out of those, the survival of the ones in first class are higher. However, these data is a very small portion (~0.023%) of the dataset, hence nothing definitive can be distilled from it. Additionally, the titles 'Mr.' and 'Ms/Mrs' correlate with the attribute 'Sex'. Name, therefore, is an attribute that we can drop. See exploration of these points below.

In [25]:
names = df[['Name', 'Pclass', 'Survived']].groupby('Pclass')
# Names with distinguishing title in Pclass 1 and their corresponding survival data
P1 = names.get_group(1)
P1[P1['Name'].str.contains('Dr. ' or 'Master. ' or 'Lady' or 'Lord')]

                              Name  Pclass  Survived
245    Minahan, Dr. William Edward       1         0
632      Stahelin-Maeglin, Dr. Max       1         1
660  Frauenthal, Dr. Henry William       1         1
766      Brewe, Dr. Arthur Jackson       1         0
796    Leader, Dr. Alice (Farnham)       1         1

In [26]:
# Names with distinguishing title in Pclass 2 and their corresponding survival data
P2 = names.get_group(2)
P2[P2['Name'].str.contains('Dr. ' or 'Master. ' or 'Lady' or 'Lord' )]

                     Name  Pclass  Survived
317  Moraweck, Dr. Ernest       2         0
398      Pain, Dr. Alfred       2         0

In [27]:
# P3 has 0 elements which means that nobody in Pclass 3 have the titles we are interested in in their names.
P3 = names.get_group(3)
P3[P3['Name'].str.contains('Dr. ' or 'Master' or 'Lady' or 'Lord' )]

Empty DataFrame
Columns: [Name, Pclass, Survived]
Index: []

In [28]:
# Those with Mr. in their name are male
names2 = df[['Name', 'Sex', 'Survived']]
names_m = names2[names2['Name'].str.contains('Mr. ' or 'Dr. ')]
names_m.head()

                              Name   Sex  Survived
0          Braund, Mr. Owen Harris  male         0
4         Allen, Mr. William Henry  male         0
5                 Moran, Mr. James  male         0
6          McCarthy, Mr. Timothy J  male         0
12  Saundercock, Mr. William Henry  male         0

In [29]:
# Those with Mrs., Ms or Miss in their name are female
names_f = names2[names2['Name'].str.contains('Mrs' or 'Ms' or 'Miss')]
names_f.head()

                                                 Name     Sex  Survived
1   Cumings, Mrs. John Bradley (Florence Briggs Th...  female         1
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)  female         1
8   Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female         1
9                 Nasser, Mrs. Nicholas (Adele Achem)  female         1
15                   Hewlett, Mrs. (Mary D Kingcome)   female         1

## Embarked

In [30]:
# Total number of passengers that survived/died in relation to the port where they embarked( C - Cherbourg, Q - Queenstown, S - Southampton)
df.groupby(['Embarked', 'Survived']).size().to_frame(name = 'Counts')

                   Counts
Embarked Survived
C        0             75
         1             93
Q        0             47
         1             30
S        0            427
         1            217

In [31]:
by_Embarked = df.groupby('Embarked')['Survived'].mean()
by_Embarked = by_Embarked.apply(lambda x: x*100).to_frame(name = '%Survived')
by_Embarked

          %Survived
Embarked
C         55.357143
Q         38.961039
S         33.695652

The data for the port where the passenger embarked suggests that those who boarded in Cherbourg (C) have a slight advantage, having a 55.4% rate of survival, while those that booarded from Queenstown(Q) and Southampton(S) fared close at 39.0% and 33.7%, respectively. Embarked has 2 entries missing.

In [32]:
df[df['Embarked'].isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Alone
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,NaN,1
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,NaN,1

Both of these passengers are alone, hence we can't cross-check for family members using their last names. Both are females and are in first class, so dropping these entries will not skew our most impactful factors. Let's look at the data entries close to these indices.

In [33]:
# Inspect data near index 61 for irregularities.
df[58:63]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Alone
58,59,1,2,"West, Miss. Constance Mirium",female,5.0,1,2,C.A. 34651,27.7500,NaN,S,0
59,60,0,3,"Goodwin, Master. William Frederick",male,11.0,5,2,CA 2144,46.9000,NaN,S,0
60,61,0,3,"Sirayanian, Mr. Orsen",male,22.0,0,0,2669,7.2292,NaN,C,1
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0000,B28,NaN,1
62,63,0,1,"Harris, Mr. Henry Birkhardt",male,45.0,1,0,36973,83.4750,C83,S,0

In [34]:
# Inspect data near index 829 for irregularities.
df[827:832]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Alone
827,828,1,2,"Mallet, Master. Andre",male,1.00,0,2,S.C./PARIS 2079,37.0042,NaN,C,0
828,829,1,3,"McCormack, Mr. Thomas Joseph",male,NaN,0,0,367228,7.7500,NaN,Q,1
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.00,0,0,113572,80.0000,B28,NaN,1
830,831,1,3,"Yasbeck, Mrs. Antoni (Selini Alexander)",female,15.00,1,0,2659,14.4542,NaN,C,0
831,832,1,2,"Richards, Master. George Sibley",male,0.83,1,1,29106,18.7500,NaN,S,0

These two entries appear to be missing at random. So I think, rather than deleting them, filling in the missing values with the most frequently occuring port will be the best solution. We can take Southampton (S), the most frequently occuring value, and assign it to passengers at index 61 and 829.

In [35]:
# Replacing missing entries in 'Embarked'
df.iloc[61, 11] = 'S'
df.iloc[829, 11] ='S'

In [36]:
# Checking if all rows are now filled. 
df['Embarked'].isnull().any()

False

## Cabin

As previously mentioned, the location of the passenger's cabin can shed light on how far or near the passengers are from the deck where the lifeboats were being loaded. Let's see how the data in this attribute looks like and evaluate its impact on survival.

In [37]:
df['Cabin'].describe()

count         204
unique        147
top       B96 B98
freq            4
Name: Cabin, dtype: object

In [38]:
df['Cabin'].isnull().sum()

687

In [39]:
df.groupby(['Cabin', 'Survived']).size()

Cabin  Survived
A10    0           1
A14    0           1
A16    1           1
A19    0           1
A20    1           1
A23    1           1
A24    0           1
A26    1           1
A31    1           1
A32    0           1
A34    1           1
A36    0           1
A5     0           1
A6     1           1
A7     0           1
B101   1           1
B102   0           1
B18    1           2
B19    0           1
B20    1           2
B22    0           1
       1           1
B28    1           2
B3     1           1
B30    0           1
B35    1           2
B37    0           1
B38    0           1
B39    1           1
B4     1           1
                  ..
E25    1           2
E31    0           1
E33    1           2
E34    1           1
E36    1           1
E38    0           1
E40    1           1
E44    0           1
       1           1
E46    0           1
E49    1           1
E50    1           1
E58    0           1
E63    0           1
E67    0           1
       1           1
E68    1           1
E77    0           1
E8     1           2
F E69  1           1
F G63  0           1
F G73  0           2
F2     0           1
       1           2
F33    1           3
F38    0           1
F4     1           2
G6     0           2
       1           2
T      0           1
Length: 163, dtype: int64

As can be seen, there's no striking observation that can be gathered from this query. However, we can see that the data can be grouped based on the Cabin's first letter designation. This may be an indicator of which deck the cabin a passenger had. Below, I grouped the data on this column based on this rationale and created an attribute 'CabinGroup' to assess its impact on survival, our dependent variable.

In [40]:
# CabinGroup attribute for grouping ages based on data distribution.
def cabin_group(cabin):
    
    cabin = str(cabin)
        
    Deck = { 'A': 1, 'B': 2, 'C': 3, 'D': 4, 'E': 5, 'F': 6, 'G': 7, 'T': 8}
    
    if cabin[0] in Deck:
        x = Deck[cabin[0]]
    else:
        x = None
    
    return x

In [41]:
df['CabinGroup'] = df['Cabin'].map(cabin_group)

In [42]:
df.groupby(['CabinGroup', 'Survived']).size().to_frame(name = 'Counts')

                     Counts
CabinGroup Survived
1.0        0              8
           1              7
2.0        0             12
           1             35
3.0        0             24
           1             35
4.0        0              8
           1             25
5.0        0              8
           1             24
6.0        0              5
           1              8
7.0        0              2
           1              2
8.0        0              1

In [43]:
by_CabinGroup = df.groupby(['CabinGroup'])['Survived'].mean()
by_CabinGroup = by_CabinGroup.apply(lambda x: x*100).to_frame(name = '% Survival')
by_CabinGroup

            % Survival
CabinGroup
1.0          46.666667
2.0          74.468085
3.0          59.322034
4.0          75.757576
5.0          75.000000
6.0          61.538462
7.0          50.000000
8.0           0.000000

Based on the % Survival data calculated from this attribute, I really can't infer anything- data shows no meaningful correlation between the two variables. 

The assumption I made earlier was that those belonging to higher social classes (Pclass = 1) will have more conveniently located cabins. I played around with the groupings and found the following:

    a.) Cabins A, B, C and T are exclusively occupied by Pclass 1 passengers.
    b.) Cabin D was a mix of Pclass 1 and 2.
    c.) Cabin E has passengers of all classes. 
    d.) Cabin F has passengers from Pclass 2 and 3
    e.) Cabin G is exclusively occupied by third class passengers.
  
 One can make the argument that Pclass can be used to ultimately deduce the missing values on Cabin. However, this would create a dependence of the Cabin variable on Pclass. Thus, the same argument used for the attribute Fare would apply. This, along with the fact that 77.1% of the data for Cabin is missing are my reasons for dropping this attribute.

## Age

In [44]:
df['Age'].isnull().sum()

177

As mentioned earlier Age has 177 entries missing. Let's first explore the impact of  the 'Age' data we have on our target attribute 'Survived'.

In [45]:
df.groupby(['Age', 'Survived']).size().head()

Age   Survived
0.42  1           1
0.67  1           1
0.75  1           2
0.83  1           2
0.92  1           1
dtype: int64

As can be expected, its quite cumbersome to treat data this way because of so many possible values for age. For us to have a better idea, lets group age into brackets. To have an idea of the divisions, lets take a look at the data we have.

In [46]:
df['Age'].dropna().describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

We will categorize ages from 0-20, 20-28, 28-38 and 38-80 and call it the 'AgeGroup' attribute. Let's see if we can extract useful observations from this grouping.

In [47]:
# AgeGroup attribute for grouping ages based on data distribution.

def age_group(age):
    
    if age <= 20:
        x = 1
    elif age >20  and age <= 28:
        x = 2
    elif age >28  and age <= 38:
        x = 3
    elif age > 38 and age <= 80:
        x = 4
    else:
        x = None
    
    return x

In [48]:
df['AgeGroup'] = df['Age'].map(age_group)

In [49]:
# Total number of passengers (out of the 714) that survived/died in each age group.
df.groupby(['AgeGroup', 'Survived']).size().to_frame(name = 'Counts')

                   Counts
AgeGroup Survived
1.0      0             97
         1             82
2.0      0            117
         1             66
3.0      0             99
         1             76
4.0      0            111
         1             66

**NOTE: Since we're still manipulating a dataframe with nan values, the resulting grouping for AgeGroup is of the type float64. When these null entries are removed, the resulting groupings will be of the int type. For convenience, I'll be referring to the int values of AgeGroup although they appear as floats in tables below.**

In [50]:
by_AgeGroup = df.groupby('AgeGroup')['Survived'].mean()
by_AgeGroup = by_AgeGroup.apply(lambda x: x*100).to_frame(name = '% Survived')
by_AgeGroup

          % Survived
AgeGroup
1.0        45.810056
2.0        36.065574
3.0        43.428571
4.0        37.288136

Passengers belonging to AgeGroup 1, those aged 0-20, have the highest rate of survival (45.8%) followed by the passengers in AgeGroup 3 with 43.4%, AgeGroup 4 with 37.3% and AgeGroup 2 with 36.1%.

Further analyzing the makeup of these categories, we can count the number of males and females in each bracket and see if certain groups fared better.

In [51]:
by_AgeGroup_Sex = df.groupby(['AgeGroup', 'Sex'])['Survived'].mean()
by_AgeGroup_Sex = by_AgeGroup_Sex.apply(lambda x: x*100).to_frame(name = '% Survived')
by_AgeGroup_Sex

                 % Survived
AgeGroup Sex
1.0      female   68.831169
         male     28.431373
2.0      female   74.603175
         male     15.833333
3.0      female   83.606557
         male     21.929825
4.0      female   76.666667
         male     17.094017

We've already established earlier that females are more likely to survive the disaster. From this data, we can further narrow down our prediction,  females aged between 28-38 have the highest rate of survival (83.6%) while older men, those aged 38-80, have the worst chances.

In [52]:
by_AgeGroup_Sex_Pclass = df.groupby(['AgeGroup', 'Sex', 'Pclass' ])['Survived'].mean()
by_AgeGroup_Sex_Pclass = by_AgeGroup_Sex_Pclass.apply(lambda x: x*100).to_frame()
by_AgeGroup_Sex_Pclass

                          Survived
AgeGroup Sex    Pclass
1.0      female 1        92.857143
                2       100.000000
                3        51.063830
         male   1        57.142857
                2        52.631579
                3        19.736842
2.0      female 1        93.333333
                2        86.363636
                3        53.846154
         male   1        56.250000
                2         0.000000
                3        12.658228
3.0      female 1       100.000000
                2        95.000000
                3        47.058824
         male   1        50.000000
                2         9.677419
                3        16.949153
4.0      female 1        96.875000
                2        87.500000
                3         8.333333
         male   1        27.777778
                2         8.333333
                3         7.692308

*First  and second class females of all age brackets have over 85% of survival. The numbers go up if these females belong to AgeGroup 1 and 3. Females belonging to Pclass 3 have lower chances around 50% for brackets 1,2,3 and going as low as 8.3% for females aged 38-80(AgeGroup 4).* 

*Like what I mentioned earlier, men have a lower rate of survival. Further analyzing the characteristics of those that survived revealed that younger males (AgeGroup 1 and 2) in first class have the highest rate of survival among men (~56%). The chances go lower for older men belonging to Pclass 3 where rate of survival is less than 10%.*

*It is hard to decipher how to treat the missing data for age. To help us decide, let'c consider analyzing the data without the entries missing age values and evaluate its impact on the target attribute 'Survived'.*

In [53]:
#Indices where no data in Age was found
age_null_index = df[df['Age'].isnull()].index
age_null_index

Int64Index([  5,  17,  19,  26,  28,  29,  31,  32,  36,  42,
            ...
            832, 837, 839, 846, 849, 859, 863, 868, 878, 888],
           dtype='int64', length=177)

In [54]:
df_age_dropped = df.drop(df.index[age_null_index])
df_age_dropped.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Alone,CabinGroup,AgeGroup
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,NaN,2.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,3.0,3.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,NaN,2.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0,3.0,3.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1,NaN,3.0

In [55]:
df_age_dropped['Age'].isnull().any()

False

We can again call the age_group function we created earlier and apply it to this new dataset.

In [56]:
df_age_dropped['AgeGroup'] = df_age_dropped['Age'].map(age_group)
df_age_dropped.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Alone,CabinGroup,AgeGroup
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,NaN,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,3.0,3
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,NaN,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0,3.0,3
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1,NaN,3

In [57]:
#Impact of 'Sex' on the target attribute using the data where indices with missing ages where dropped.
By_sex = df_age_dropped.groupby('Sex')['Survived'].mean()
By_sex = By_sex.apply(lambda x: x*100).to_frame(name = '% Survived')
By_sex

        % Survived
Sex
female   75.478927
male     20.529801

In [58]:
#Impact of 'Pclass' on the target attribute using the data where indices with missing ages where dropped.
By_Pclass = df_age_dropped.groupby('Pclass')['Survived'].mean()
By_Pclass = By_Pclass.apply(lambda x: x*100).to_frame(name = '% Survived')
By_Pclass

        % Survived
Pclass
1        65.591398
2        47.976879
3        23.943662

In [59]:
#Impact of 'Alone' on the target attribute using the data where indices with missing ages where dropped.
df_age_dropped['Alone'] = df_age_dropped[['SibSp', 'Parch']].apply(is_Alone, axis = 1)
By_Alone = df_age_dropped.groupby('Alone')['Survived'].mean()
By_Alone = By_Alone.apply(lambda x: x*100).to_frame(name = '% Survived')
By_Alone

       % Survived
Alone
0       51.612903
1       32.178218

In [60]:
#Impact of 'Embarked' on the target attribute using the data where indices with missing ages where dropped.
By_Embarked = df_age_dropped.groupby('Embarked')['Survived'].mean()
By_Embarked = By_Embarked.apply(lambda x: x*100).to_frame(name = '% Survived')
By_Embarked

          % Survived
Embarked
C          60.769231
Q          28.571429
S          36.510791

Based on the calculations of % Survived for the attributes illustrated above, there seems to be not much of a difference between the data set where entries with missing ages are dropped. The same general trends were observed: Women have a higher rate of survival than men, Pclass 1 have the highest chances of making it and being Alone lowers one chances for surviving. Due to this, I am dropping the entries with null Age values. (Note: I realized today that one thing I can do to prove this is to test for significance. I will work on this on the coming days. However, for this assignment submission, I will assume no signifant difference.)

## PassengersId

*The attribute 'PassengersId' will later be used as the index for the final clean dataset.*

# Generalizations

**In review, the following attributes are being included in the analysis: ** 
*  Sex
*  Pclass
*  Alone
*  AgeGroup
*  Embarked
*  PassengerId

**The following attributes are to be dropped:**
* Fare
* SibSp
* Parch
* Name
* Cabin

**Missing data handling:**
* Embarked(2) - filled in with most occuring value
* Cabin(687) - Cabin column dropped
* Age(177) - entries with missing age values were not included

## Transforming Non-Numeric Attributes

In order to verify these initial observations, we can calculate the correlation of all the attributes to the target attribute 'Survived.' To accomplish this, we need to have numeric values for all the attributes we wish to check. Name, Ticket, Cabin, Sex and Embarked all have string characters. From the argument detailed above, the attributes Name, Ticket and Cabin will be dropped. The data on Sex and Embarked will be converted to numerical entries using the codes outlined below: code_gender for Sex and code_embark for Embarked.

In [61]:
# Code for converting Sex data to numeric data
def code_gender(sex):
    
    if sex == 'male':
        x = 0
    elif sex =='female':
        x = 1
        
    return x

In [62]:
# transforming Sex data of the original dataframe (df)
df['Sex_Coded'] = df['Sex'].map(code_gender)

In [63]:
# Code for converting Embark data to numeric
def code_embark(port):
    
    if port == 'C':
        x = 1
    elif port == 'Q':
        x = 2
    elif port == 'S':
        x = 3
    
    return x

In [64]:
# transforming Embarked data of the original dataframe (df)
df['Embarked_Coded'] = df['Embarked'].map(code_embark)

At this point, all our relevant attributes are in numeric form and can be plugged in to our code for calculating for correlation with 'Survived'.

# Get correlation of attributes with  the target attribute

In [65]:

def get_correlation_with_target(attribute):
    "Returns the pearson correlation coefficient of attribute with the target data, df['Survived']."
    corr = attribute.corr(df['Survived'])
    
    return round(corr, 2)


def corr_calc(attributes_list):
    
    corr_coefficient = pd.DataFrame(list(map(get_correlation_with_target, attributes_list)))
    corr_coefficient = corr_coefficient.rename(index = {0: 'PassengerID',
                                                                                            1: 'Pclass',
                                                                                            2: 'Fare', 
                                                                                            3: 'Sex', 
                                                                                            4: 'SibSp', 
                                                                                            5: 'Parch', 
                                                                                            6: 'Alone', 
                                                                                            7: 'Embarked',
                                                                                            8: 'Age',
                                                                                            9: 'AgeGroup',
                                                                                            10: 'CabinGroup'},
                                                           columns = {0: 'Pearson Correlation Coefficient'})

    return corr_coefficient

In [66]:
# list of attributes for the dataframe with the entries with missing age values
df_with_nullAge = pd.Series([df['PassengerId'], df['Pclass'],  df['Fare'], 
                               df['Sex_Coded'], df['SibSp'], df['Parch'], df['Alone'], 
                               df['Embarked_Coded'], df['Age'], df['AgeGroup'],
                                df['CabinGroup']])

In [67]:
df_a = corr_calc(df_with_nullAge) # Calculating the correlation coefficient for attributes of the dataframe with null age values.
df_a

             Pearson Correlation Coefficient
PassengerID                            -0.01
Pclass                                 -0.34
Fare                                    0.26
Sex                                     0.54
SibSp                                  -0.04
Parch                                   0.08
Alone                                  -0.20
Embarked                               -0.17
Age                                    -0.08
AgeGroup                               -0.04
CabinGroup                              0.02

The results we got from the correlation calculations are similar to the observations deduced when we analyzed each attribute.
* Sex has the strongest association (0.54) with the dependent variable Survived. (Correlation coefficients from +/- 0.5 to 1.0 are considered strong/large)
* Next is Pclass, with a correlation coefficient of -0.34 (Correlation coefficients between +/- 0.3 to 0.5 considered as having moderate/medium correlation.)
* Fare, Alone and Embarked all have coefficients between +/- 0.1 to 0.3, a range considered to have small correlation.
* SibSp, Parch and CabinGroup all have values below +/- 0.1. A range considered to have very weak/ no associations.
* Age and AgeGroup also scored low on this measure. This is expected since the Pearson correlation calculation is not appropriate for analyzing non-linear relationship such as the case of Age and AgeGroup.
* PassengerId was included for completeness. Although the very low calculated corr suggest that it doesn't influence 'Survived' at all.

Now, I want to check how these values will be affected if we use the dataset where we dropped the entries with missing age values.

In [68]:
df_age_dropped['CabinGroup'] = df_age_dropped['Cabin'].map(cabin_group) # Grouping cabins for df without entries with missing Age.
df_age_dropped['Sex_Coded'] = df_age_dropped['Sex'].map(code_gender) # Coding Sex for df without entries with missing Age.
df_age_dropped['Embarked_Coded'] = df_age_dropped['Embarked'].map(code_embark) # Coding Embarked for df without entries with missing Age.

In [69]:
# list of attributes for the dataframe without the entries with missing age values
df_wo_nullAge = pd.Series([df_age_dropped['PassengerId'], df_age_dropped['Pclass'],
                                df_age_dropped['Fare'], df_age_dropped['Sex_Coded'], 
                                df_age_dropped['SibSp'], df_age_dropped['Parch'],
                                df_age_dropped['Alone'],df_age_dropped['Embarked_Coded'],
                                df_age_dropped['Age'], df_age_dropped['AgeGroup'], 
                                df_age_dropped['CabinGroup']])

In [70]:
df_na = corr_calc(df_wo_nullAge) # Calculating the correlation coefficient for attributes of the dataframe without null age values.

In [71]:
# Comparing the correlation coefficients of the two datasets
corr_compare = pd.concat([df_a, df_na], axis=1)
corr_compare.columns = ['Correlation Coefficient for df with Null Age Entries', 'Correlation Coefficient for df wo Null Age Entries']
corr_compare['Difference'] = corr_compare['Correlation Coefficient for df with Null Age Entries'] - corr_compare['Correlation Coefficient for df wo Null Age Entries']
corr_compare

,Correlation Coefficient for df with Null Age Entries,Correlation Coefficient for df wo Null Age Entries,Difference
PassengerID,-0.01,0.03,-0.04
Pclass,-0.34,-0.36,0.02
Fare,0.26,0.27,-0.01
Sex,0.54,0.54,0.00
SibSp,-0.04,-0.02,-0.02
Parch,0.08,0.09,-0.01
Alone,-0.20,-0.20,0.00
Embarked,-0.17,-0.18,0.01
Age,-0.08,-0.08,0.00
AgeGroup,-0.04,-0.04,0.00
CabinGroup,0.02,-0.03,0.05

The same trend can be observed for datasets where entries with null age data were dropped. Hence, dropping them didn't significantly affect the dataset.
(Note: I'm pretty sure I should be doing more significance testing for this.)

# Cleaning Data

In [72]:
drop_attributes = ['Fare', 'Ticket', 'Name', 'SibSp', 'Parch', 'Cabin',  'Age', 'Sex', 'CabinGroup', 'Embarked']
df_clean = df_age_dropped.drop(drop_attributes, axis =1) 
clean_train_df = df_clean.set_index('PassengerId')

clean_train_df.head()

             Survived  Pclass  Alone  AgeGroup  Sex_Coded  Embarked_Coded
PassengerId
1                   0       3      0         2          0               3
2                   1       1      0         3          1               1
3                   1       3      1         2          1               3
4                   1       1      0         3          1               3
5                   0       3      1         3          0               3

In [73]:
clean_train_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 714 entries, 1 to 891
Data columns (total 6 columns):
Survived          714 non-null int64
Pclass            714 non-null int64
Alone             714 non-null int64
AgeGroup          714 non-null int64
Sex_Coded         714 non-null int64
Embarked_Coded    714 non-null int64
dtypes: int64(6)
memory usage: 39.0 KB

In [74]:
clean_train_df.isnull().any()

Survived          False
Pclass            False
Alone             False
AgeGroup          False
Sex_Coded         False
Embarked_Coded    False
dtype: bool